artillery/scenarios/stress-test.yml
config:
  target: "https://jsonplaceholder.typicode.com"
  phases:
    - duration: 120
      arrivalRate: 50
      name: "Ramp up to 50 users/sec"
    - duration: 300
      arrivalRate: 100
      name: "Sustained stress at 100 users/sec"
    - duration: 120
      arrivalRate: 150
      name: "Maximum stress at 150 users/sec"
    - duration: 180
      arrivalRate: 150
      name: "Hold at maximum"
    - duration: 120
      arrivalRate: 10
      name: "Ramp down"
  defaults:
    headers:
      User-Agent: "Artillery Stress Test"

scenarios:
  - name: "High Load Scenario"
    flow:
      - get:
          url: "/posts"
      - think: 0.2

      - get:
          url: "/posts/{{ $randomNumber(1, 100) }}"
      - think: 0.2

      - post:
          url: "/posts"
          json:
            title: "Stress test {{ $randomNumber(1, 1000) }}"
            body: "Testing under high stress"
            userId: "{{ $randomNumber(1, 10) }}"
      - think: 0.2